GopalSaraf/Practicals/PSDL/include/proc/pic16lf1778.inc
// Register: DAC2REFL
#define DAC2REFL DAC2REFL
DAC2REFL                                 equ 0592h
// bitfield definitions
DAC2REFL_REF0_POSN                       equ 0000h
DAC2REFL_REF0_POSITION                   equ 0000h
DAC2REFL_REF0_SIZE                       equ 0001h
DAC2REFL_REF0_LENGTH                     equ 0001h
DAC2REFL_REF0_MASK                       equ 0001h
DAC2REFL_REF1_POSN                       equ 0001h
DAC2REFL_REF1_POSITION                   equ 0001h
DAC2REFL_REF1_SIZE                       equ 0001h
DAC2REFL_REF1_LENGTH                     equ 0001h
DAC2REFL_REF1_MASK                       equ 0002h
DAC2REFL_REF2_POSN                       equ 0002h
DAC2REFL_REF2_POSITION                   equ 0002h
DAC2REFL_REF2_SIZE                       equ 0001h
DAC2REFL_REF2_LENGTH                     equ 0001h
DAC2REFL_REF2_MASK                       equ 0004h
DAC2REFL_REF3_POSN                       equ 0003h
DAC2REFL_REF3_POSITION                   equ 0003h
DAC2REFL_REF3_SIZE                       equ 0001h
DAC2REFL_REF3_LENGTH                     equ 0001h
DAC2REFL_REF3_MASK                       equ 0008h
DAC2REFL_REF4_POSN                       equ 0004h
DAC2REFL_REF4_POSITION                   equ 0004h
DAC2REFL_REF4_SIZE                       equ 0001h
DAC2REFL_REF4_LENGTH                     equ 0001h
DAC2REFL_REF4_MASK                       equ 0010h
DAC2REFL_REF5_POSN                       equ 0005h
DAC2REFL_REF5_POSITION                   equ 0005h
DAC2REFL_REF5_SIZE                       equ 0001h
DAC2REFL_REF5_LENGTH                     equ 0001h
DAC2REFL_REF5_MASK                       equ 0020h
DAC2REFL_REF6_POSN                       equ 0006h
DAC2REFL_REF6_POSITION                   equ 0006h
DAC2REFL_REF6_SIZE                       equ 0001h
DAC2REFL_REF6_LENGTH                     equ 0001h
DAC2REFL_REF6_MASK                       equ 0040h
DAC2REFL_REF7_POSN                       equ 0007h
DAC2REFL_REF7_POSITION                   equ 0007h
DAC2REFL_REF7_SIZE                       equ 0001h
DAC2REFL_REF7_LENGTH                     equ 0001h
DAC2REFL_REF7_MASK                       equ 0080h
DAC2REFL_DAC2REF0_POSN                   equ 0000h
DAC2REFL_DAC2REF0_POSITION               equ 0000h
DAC2REFL_DAC2REF0_SIZE                   equ 0001h
DAC2REFL_DAC2REF0_LENGTH                 equ 0001h
DAC2REFL_DAC2REF0_MASK                   equ 0001h
DAC2REFL_DAC2REF1_POSN                   equ 0001h
DAC2REFL_DAC2REF1_POSITION               equ 0001h
DAC2REFL_DAC2REF1_SIZE                   equ 0001h
DAC2REFL_DAC2REF1_LENGTH                 equ 0001h
DAC2REFL_DAC2REF1_MASK                   equ 0002h
DAC2REFL_DAC2REF2_POSN                   equ 0002h
DAC2REFL_DAC2REF2_POSITION               equ 0002h
DAC2REFL_DAC2REF2_SIZE                   equ 0001h
DAC2REFL_DAC2REF2_LENGTH                 equ 0001h
DAC2REFL_DAC2REF2_MASK                   equ 0004h
DAC2REFL_DAC2REF3_POSN                   equ 0003h
DAC2REFL_DAC2REF3_POSITION               equ 0003h
DAC2REFL_DAC2REF3_SIZE                   equ 0001h
DAC2REFL_DAC2REF3_LENGTH                 equ 0001h
DAC2REFL_DAC2REF3_MASK                   equ 0008h
DAC2REFL_DAC2REF4_POSN                   equ 0004h
DAC2REFL_DAC2REF4_POSITION               equ 0004h
DAC2REFL_DAC2REF4_SIZE                   equ 0001h
DAC2REFL_DAC2REF4_LENGTH                 equ 0001h
DAC2REFL_DAC2REF4_MASK                   equ 0010h
DAC2REFL_DAC2REF5_POSN                   equ 0005h
DAC2REFL_DAC2REF5_POSITION               equ 0005h
DAC2REFL_DAC2REF5_SIZE                   equ 0001h
DAC2REFL_DAC2REF5_LENGTH                 equ 0001h
DAC2REFL_DAC2REF5_MASK                   equ 0020h
DAC2REFL_DAC2REF6_POSN                   equ 0006h
DAC2REFL_DAC2REF6_POSITION               equ 0006h
DAC2REFL_DAC2REF6_SIZE                   equ 0001h
DAC2REFL_DAC2REF6_LENGTH                 equ 0001h
DAC2REFL_DAC2REF6_MASK                   equ 0040h
DAC2REFL_DAC2REF7_POSN                   equ 0007h
DAC2REFL_DAC2REF7_POSITION               equ 0007h
DAC2REFL_DAC2REF7_SIZE                   equ 0001h
DAC2REFL_DAC2REF7_LENGTH                 equ 0001h
DAC2REFL_DAC2REF7_MASK                   equ 0080h
DAC2REFL_R0_POSN                         equ 0000h
DAC2REFL_R0_POSITION                     equ 0000h
DAC2REFL_R0_SIZE                         equ 0001h
DAC2REFL_R0_LENGTH                       equ 0001h
DAC2REFL_R0_MASK                         equ 0001h
DAC2REFL_R1_POSN                         equ 0001h
DAC2REFL_R1_POSITION                     equ 0001h
DAC2REFL_R1_SIZE                         equ 0001h
DAC2REFL_R1_LENGTH                       equ 0001h
DAC2REFL_R1_MASK                         equ 0002h
DAC2REFL_R2_POSN                         equ 0002h
DAC2REFL_R2_POSITION                     equ 0002h
DAC2REFL_R2_SIZE                         equ 0001h
DAC2REFL_R2_LENGTH                       equ 0001h
DAC2REFL_R2_MASK                         equ 0004h
DAC2REFL_R3_POSN                         equ 0003h
DAC2REFL_R3_POSITION                     equ 0003h
DAC2REFL_R3_SIZE                         equ 0001h
DAC2REFL_R3_LENGTH                       equ 0001h
DAC2REFL_R3_MASK                         equ 0008h
DAC2REFL_R4_POSN                         equ 0004h
DAC2REFL_R4_POSITION                     equ 0004h
DAC2REFL_R4_SIZE                         equ 0001h
DAC2REFL_R4_LENGTH                       equ 0001h
DAC2REFL_R4_MASK                         equ 0010h
DAC2REFL_R5_POSN                         equ 0005h
DAC2REFL_R5_POSITION                     equ 0005h
DAC2REFL_R5_SIZE                         equ 0001h
DAC2REFL_R5_LENGTH                       equ 0001h
DAC2REFL_R5_MASK                         equ 0020h
DAC2REFL_R6_POSN                         equ 0006h
DAC2REFL_R6_POSITION                     equ 0006h
DAC2REFL_R6_SIZE                         equ 0001h
DAC2REFL_R6_LENGTH                       equ 0001h
DAC2REFL_R6_MASK                         equ 0040h
DAC2REFL_R7_POSN                         equ 0007h
DAC2REFL_R7_POSITION                     equ 0007h
DAC2REFL_R7_SIZE                         equ 0001h
DAC2REFL_R7_LENGTH                       equ 0001h
DAC2REFL_R7_MASK                         equ 0080h
DAC2REFL_DAC2R0_POSN                     equ 0000h
DAC2REFL_DAC2R0_POSITION                 equ 0000h
DAC2REFL_DAC2R0_SIZE                     equ 0001h
DAC2REFL_DAC2R0_LENGTH                   equ 0001h
DAC2REFL_DAC2R0_MASK                     equ 0001h
DAC2REFL_DAC2R1_POSN                     equ 0001h
DAC2REFL_DAC2R1_POSITION                 equ 0001h
DAC2REFL_DAC2R1_SIZE                     equ 0001h
DAC2REFL_DAC2R1_LENGTH                   equ 0001h
DAC2REFL_DAC2R1_MASK                     equ 0002h
DAC2REFL_DAC2R2_POSN                     equ 0002h
DAC2REFL_DAC2R2_POSITION                 equ 0002h
DAC2REFL_DAC2R2_SIZE                     equ 0001h
DAC2REFL_DAC2R2_LENGTH                   equ 0001h
DAC2REFL_DAC2R2_MASK                     equ 0004h
DAC2REFL_DAC2R3_POSN                     equ 0003h
DAC2REFL_DAC2R3_POSITION                 equ 0003h
DAC2REFL_DAC2R3_SIZE                     equ 0001h
DAC2REFL_DAC2R3_LENGTH                   equ 0001h
DAC2REFL_DAC2R3_MASK                     equ 0008h
DAC2REFL_DAC2R4_POSN                     equ 0004h
DAC2REFL_DAC2R4_POSITION                 equ 0004h
DAC2REFL_DAC2R4_SIZE                     equ 0001h
DAC2REFL_DAC2R4_LENGTH                   equ 0001h
DAC2REFL_DAC2R4_MASK                     equ 0010h
DAC2REFL_DAC2R5_POSN                     equ 0005h
DAC2REFL_DAC2R5_POSITION                 equ 0005h
DAC2REFL_DAC2R5_SIZE                     equ 0001h
DAC2REFL_DAC2R5_LENGTH                   equ 0001h
DAC2REFL_DAC2R5_MASK                     equ 0020h
DAC2REFL_DAC2R6_POSN                     equ 0006h
DAC2REFL_DAC2R6_POSITION                 equ 0006h
DAC2REFL_DAC2R6_SIZE                     equ 0001h
DAC2REFL_DAC2R6_LENGTH                   equ 0001h
DAC2REFL_DAC2R6_MASK                     equ 0040h
DAC2REFL_DAC2R7_POSN                     equ 0007h
DAC2REFL_DAC2R7_POSITION                 equ 0007h
DAC2REFL_DAC2R7_SIZE                     equ 0001h
DAC2REFL_DAC2R7_LENGTH                   equ 0001h
DAC2REFL_DAC2R7_MASK                     equ 0080h

// Register: DAC2REFH
#define DAC2REFH DAC2REFH
DAC2REFH                                 equ 0593h
// bitfield definitions
DAC2REFH_REF8_POSN                       equ 0000h
DAC2REFH_REF8_POSITION                   equ 0000h
DAC2REFH_REF8_SIZE                       equ 0001h
DAC2REFH_REF8_LENGTH                     equ 0001h
DAC2REFH_REF8_MASK                       equ 0001h
DAC2REFH_REF9_POSN                       equ 0001h
DAC2REFH_REF9_POSITION                   equ 0001h
DAC2REFH_REF9_SIZE                       equ 0001h
DAC2REFH_REF9_LENGTH                     equ 0001h
DAC2REFH_REF9_MASK                       equ 0002h
DAC2REFH_REF10_POSN                      equ 0002h
DAC2REFH_REF10_POSITION                  equ 0002h
DAC2REFH_REF10_SIZE                      equ 0001h
DAC2REFH_REF10_LENGTH                    equ 0001h
DAC2REFH_REF10_MASK                      equ 0004h
DAC2REFH_REF11_POSN                      equ 0003h
DAC2REFH_REF11_POSITION                  equ 0003h
DAC2REFH_REF11_SIZE                      equ 0001h
DAC2REFH_REF11_LENGTH                    equ 0001h
DAC2REFH_REF11_MASK                      equ 0008h
DAC2REFH_REF12_POSN                      equ 0004h
DAC2REFH_REF12_POSITION                  equ 0004h
DAC2REFH_REF12_SIZE                      equ 0001h
DAC2REFH_REF12_LENGTH                    equ 0001h
DAC2REFH_REF12_MASK                      equ 0010h
DAC2REFH_REF13_POSN                      equ 0005h
DAC2REFH_REF13_POSITION                  equ 0005h
DAC2REFH_REF13_SIZE                      equ 0001h
DAC2REFH_REF13_LENGTH                    equ 0001h
DAC2REFH_REF13_MASK                      equ 0020h
DAC2REFH_REF14_POSN                      equ 0006h
DAC2REFH_REF14_POSITION                  equ 0006h
DAC2REFH_REF14_SIZE                      equ 0001h
DAC2REFH_REF14_LENGTH                    equ 0001h
DAC2REFH_REF14_MASK                      equ 0040h
DAC2REFH_REF15_POSN                      equ 0007h
DAC2REFH_REF15_POSITION                  equ 0007h
DAC2REFH_REF15_SIZE                      equ 0001h
DAC2REFH_REF15_LENGTH                    equ 0001h
DAC2REFH_REF15_MASK                      equ 0080h
DAC2REFH_DAC2REF8_POSN                   equ 0000h
DAC2REFH_DAC2REF8_POSITION               equ 0000h
DAC2REFH_DAC2REF8_SIZE                   equ 0001h
DAC2REFH_DAC2REF8_LENGTH                 equ 0001h
DAC2REFH_DAC2REF8_MASK                   equ 0001h
DAC2REFH_DAC2REF9_POSN                   equ 0001h
DAC2REFH_DAC2REF9_POSITION               equ 0001h
DAC2REFH_DAC2REF9_SIZE                   equ 0001h
DAC2REFH_DAC2REF9_LENGTH                 equ 0001h
DAC2REFH_DAC2REF9_MASK                   equ 0002h
DAC2REFH_DAC2REF10_POSN                  equ 0002h
DAC2REFH_DAC2REF10_POSITION              equ 0002h
DAC2REFH_DAC2REF10_SIZE                  equ 0001h
DAC2REFH_DAC2REF10_LENGTH                equ 0001h
DAC2REFH_DAC2REF10_MASK                  equ 0004h
DAC2REFH_DAC2REF11_POSN                  equ 0003h
DAC2REFH_DAC2REF11_POSITION              equ 0003h
DAC2REFH_DAC2REF11_SIZE                  equ 0001h
DAC2REFH_DAC2REF11_LENGTH                equ 0001h
DAC2REFH_DAC2REF11_MASK                  equ 0008h
DAC2REFH_DAC2REF12_POSN                  equ 0004h
DAC2REFH_DAC2REF12_POSITION              equ 0004h
DAC2REFH_DAC2REF12_SIZE                  equ 0001h
DAC2REFH_DAC2REF12_LENGTH                equ 0001h
DAC2REFH_DAC2REF12_MASK                  equ 0010h
DAC2REFH_DAC2REF13_POSN                  equ 0005h
DAC2REFH_DAC2REF13_POSITION              equ 0005h
DAC2REFH_DAC2REF13_SIZE                  equ 0001h
DAC2REFH_DAC2REF13_LENGTH                equ 0001h
DAC2REFH_DAC2REF13_MASK                  equ 0020h
DAC2REFH_DAC2REF14_POSN                  equ 0006h
DAC2REFH_DAC2REF14_POSITION              equ 0006h
DAC2REFH_DAC2REF14_SIZE                  equ 0001h
DAC2REFH_DAC2REF14_LENGTH                equ 0001h
DAC2REFH_DAC2REF14_MASK                  equ 0040h
DAC2REFH_DAC2REF15_POSN                  equ 0007h
DAC2REFH_DAC2REF15_POSITION              equ 0007h
DAC2REFH_DAC2REF15_SIZE                  equ 0001h
DAC2REFH_DAC2REF15_LENGTH                equ 0001h
DAC2REFH_DAC2REF15_MASK                  equ 0080h
DAC2REFH_R8_POSN                         equ 0000h
DAC2REFH_R8_POSITION                     equ 0000h
DAC2REFH_R8_SIZE                         equ 0001h
DAC2REFH_R8_LENGTH                       equ 0001h
DAC2REFH_R8_MASK                         equ 0001h
DAC2REFH_R9_POSN                         equ 0001h
DAC2REFH_R9_POSITION                     equ 0001h
DAC2REFH_R9_SIZE                         equ 0001h
DAC2REFH_R9_LENGTH                       equ 0001h
DAC2REFH_R9_MASK                         equ 0002h
DAC2REFH_R10_POSN                        equ 0002h
DAC2REFH_R10_POSITION                    equ 0002h
DAC2REFH_R10_SIZE                        equ 0001h
DAC2REFH_R10_LENGTH                      equ 0001h
DAC2REFH_R10_MASK                        equ 0004h
DAC2REFH_R11_POSN                        equ 0003h
DAC2REFH_R11_POSITION                    equ 0003h
DAC2REFH_R11_SIZE                        equ 0001h
DAC2REFH_R11_LENGTH                      equ 0001h
DAC2REFH_R11_MASK                        equ 0008h
DAC2REFH_R12_POSN                        equ 0004h
DAC2REFH_R12_POSITION                    equ 0004h
DAC2REFH_R12_SIZE                        equ 0001h
DAC2REFH_R12_LENGTH                      equ 0001h
DAC2REFH_R12_MASK                        equ 0010h
DAC2REFH_R13_POSN                        equ 0005h
DAC2REFH_R13_POSITION                    equ 0005h
DAC2REFH_R13_SIZE                        equ 0001h
DAC2REFH_R13_LENGTH                      equ 0001h
DAC2REFH_R13_MASK                        equ 0020h
DAC2REFH_R14_POSN                        equ 0006h
DAC2REFH_R14_POSITION                    equ 0006h
DAC2REFH_R14_SIZE                        equ 0001h
DAC2REFH_R14_LENGTH                      equ 0001h
DAC2REFH_R14_MASK                        equ 0040h
DAC2REFH_R15_POSN                        equ 0007h
DAC2REFH_R15_POSITION                    equ 0007h
DAC2REFH_R15_SIZE                        equ 0001h
DAC2REFH_R15_LENGTH                      equ 0001h
DAC2REFH_R15_MASK                        equ 0080h
DAC2REFH_DAC2R8_POSN                     equ 0000h
DAC2REFH_DAC2R8_POSITION                 equ 0000h
DAC2REFH_DAC2R8_SIZE                     equ 0001h
DAC2REFH_DAC2R8_LENGTH                   equ 0001h
DAC2REFH_DAC2R8_MASK                     equ 0001h
DAC2REFH_DAC2R9_POSN                     equ 0001h
DAC2REFH_DAC2R9_POSITION                 equ 0001h
DAC2REFH_DAC2R9_SIZE                     equ 0001h
DAC2REFH_DAC2R9_LENGTH                   equ 0001h
DAC2REFH_DAC2R9_MASK                     equ 0002h
DAC2REFH_DAC2R10_POSN                    equ 0002h
DAC2REFH_DAC2R10_POSITION                equ 0002h
DAC2REFH_DAC2R10_SIZE                    equ 0001h
DAC2REFH_DAC2R10_LENGTH                  equ 0001h
DAC2REFH_DAC2R10_MASK                    equ 0004h
DAC2REFH_DAC2R11_POSN                    equ 0003h
DAC2REFH_DAC2R11_POSITION                equ 0003h
DAC2REFH_DAC2R11_SIZE                    equ 0001h
DAC2REFH_DAC2R11_LENGTH                  equ 0001h
DAC2REFH_DAC2R11_MASK                    equ 0008h
DAC2REFH_DAC2R12_POSN                    equ 0004h
DAC2REFH_DAC2R12_POSITION                equ 0004h
DAC2REFH_DAC2R12_SIZE                    equ 0001h
DAC2REFH_DAC2R12_LENGTH                  equ 0001h
DAC2REFH_DAC2R12_MASK                    equ 0010h
DAC2REFH_DAC2R13_POSN                    equ 0005h
DAC2REFH_DAC2R13_POSITION                equ 0005h
DAC2REFH_DAC2R13_SIZE                    equ 0001h
DAC2REFH_DAC2R13_LENGTH                  equ 0001h
DAC2REFH_DAC2R13_MASK                    equ 0020h
DAC2REFH_DAC2R14_POSN                    equ 0006h
DAC2REFH_DAC2R14_POSITION                equ 0006h
DAC2REFH_DAC2R14_SIZE                    equ 0001h
DAC2REFH_DAC2R14_LENGTH                  equ 0001h
DAC2REFH_DAC2R14_MASK                    equ 0040h
DAC2REFH_DAC2R15_POSN                    equ 0007h
DAC2REFH_DAC2R15_POSITION                equ 0007h
DAC2REFH_DAC2R15_SIZE                    equ 0001h
DAC2REFH_DAC2R15_LENGTH                  equ 0001h
DAC2REFH_DAC2R15_MASK                    equ 0080h

// Register: DAC3CON0
#define DAC3CON0 DAC3CON0
DAC3CON0                                 equ 0594h
// bitfield definitions
DAC3CON0_NSS_POSN                        equ 0000h
DAC3CON0_NSS_POSITION                    equ 0000h
DAC3CON0_NSS_SIZE                        equ 0002h
DAC3CON0_NSS_LENGTH                      equ 0002h
DAC3CON0_NSS_MASK                        equ 0003h
DAC3CON0_PSS_POSN                        equ 0002h
DAC3CON0_PSS_POSITION                    equ 0002h
DAC3CON0_PSS_SIZE                        equ 0002h
DAC3CON0_PSS_LENGTH                      equ 0002h
DAC3CON0_PSS_MASK                        equ 000Ch
DAC3CON0_OE2_POSN                        equ 0004h
DAC3CON0_OE2_POSITION                    equ 0004h
DAC3CON0_OE2_SIZE                        equ 0001h
DAC3CON0_OE2_LENGTH                      equ 0001h
DAC3CON0_OE2_MASK                        equ 0010h
DAC3CON0_OE1_POSN                        equ 0005h
DAC3CON0_OE1_POSITION                    equ 0005h
DAC3CON0_OE1_SIZE                        equ 0001h
DAC3CON0_OE1_LENGTH                      equ 0001h
DAC3CON0_OE1_MASK                        equ 0020h
DAC3CON0_EN_POSN                         equ 0007h
DAC3CON0_EN_POSITION                     equ 0007h
DAC3CON0_EN_SIZE                         equ 0001h
DAC3CON0_EN_LENGTH                       equ 0001h
DAC3CON0_EN_MASK                         equ 0080h
DAC3CON0_NSS0_POSN                       equ 0000h
DAC3CON0_NSS0_POSITION                   equ 0000h
DAC3CON0_NSS0_SIZE                       equ 0001h
DAC3CON0_NSS0_LENGTH                     equ 0001h
DAC3CON0_NSS0_MASK                       equ 0001h
DAC3CON0_NSS1_POSN                       equ 0001h
DAC3CON0_NSS1_POSITION                   equ 0001h
DAC3CON0_NSS1_SIZE                       equ 0001h
DAC3CON0_NSS1_LENGTH                     equ 0001h
DAC3CON0_NSS1_MASK                       equ 0002h
DAC3CON0_PSS0_POSN                       equ 0002h
DAC3CON0_PSS0_POSITION                   equ 0002h
DAC3CON0_PSS0_SIZE                       equ 0001h
DAC3CON0_PSS0_LENGTH                     equ 0001h
DAC3CON0_PSS0_MASK                       equ 0004h
DAC3CON0_PSS1_POSN                       equ 0003h
DAC3CON0_PSS1_POSITION                   equ 0003h
DAC3CON0_PSS1_SIZE                       equ 0001h
DAC3CON0_PSS1_LENGTH                     equ 0001h
DAC3CON0_PSS1_MASK                       equ 0008h
DAC3CON0_DACNSS_POSN                     equ 0000h
DAC3CON0_DACNSS_POSITION                 equ 0000h
DAC3CON0_DACNSS_SIZE                     equ 0002h
DAC3CON0_DACNSS_LENGTH                   equ 0002h
DAC3CON0_DACNSS_MASK                     equ 0003h
DAC3CON0_DACPSS_POSN                     equ 0002h
DAC3CON0_DACPSS_POSITION                 equ 0002h
DAC3CON0_DACPSS_SIZE                     equ 0002h
DAC3CON0_DACPSS_LENGTH                   equ 0002h
DAC3CON0_DACPSS_MASK                     equ 000Ch
DAC3CON0_DACOE2_POSN                     equ 0004h
DAC3CON0_DACOE2_POSITION                 equ 0004h
DAC3CON0_DACOE2_SIZE                     equ 0001h
DAC3CON0_DACOE2_LENGTH                   equ 0001h
DAC3CON0_DACOE2_MASK                     equ 0010h
DAC3CON0_DACOE1_POSN                     equ 0005h
DAC3CON0_DACOE1_POSITION                 equ 0005h
DAC3CON0_DACOE1_SIZE                     equ 0001h
DAC3CON0_DACOE1_LENGTH                   equ 0001h
DAC3CON0_DACOE1_MASK                     equ 0020h
DAC3CON0_DACEN_POSN                      equ 0007h
DAC3CON0_DACEN_POSITION                  equ 0007h
DAC3CON0_DACEN_SIZE                      equ 0001h
DAC3CON0_DACEN_LENGTH                    equ 0001h
DAC3CON0_DACEN_MASK                      equ 0080h
DAC3CON0_DACNSS0_POSN                    equ 0000h
DAC3CON0_DACNSS0_POSITION                equ 0000h
DAC3CON0_DACNSS0_SIZE                    equ 0001h
DAC3CON0_DACNSS0_LENGTH                  equ 0001h
DAC3CON0_DACNSS0_MASK                    equ 0001h
DAC3CON0_DACNSS1_POSN                    equ 0001h
DAC3CON0_DACNSS1_POSITION                equ 0001h
DAC3CON0_DACNSS1_SIZE                    equ 0001h
DAC3CON0_DACNSS1_LENGTH                  equ 0001h
DAC3CON0_DACNSS1_MASK                    equ 0002h
DAC3CON0_DACPSS0_POSN                    equ 0002h
DAC3CON0_DACPSS0_POSITION                equ 0002h
DAC3CON0_DACPSS0_SIZE                    equ 0001h
DAC3CON0_DACPSS0_LENGTH                  equ 0001h
DAC3CON0_DACPSS0_MASK                    equ 0004h
DAC3CON0_DACPSS1_POSN                    equ 0003h
DAC3CON0_DACPSS1_POSITION                equ 0003h
DAC3CON0_DACPSS1_SIZE                    equ 0001h
DAC3CON0_DACPSS1_LENGTH                  equ 0001h
DAC3CON0_DACPSS1_MASK                    equ 0008h
DAC3CON0_DAC3NSS_POSN                    equ 0000h
DAC3CON0_DAC3NSS_POSITION                equ 0000h
DAC3CON0_DAC3NSS_SIZE                    equ 0002h
DAC3CON0_DAC3NSS_LENGTH                  equ 0002h
DAC3CON0_DAC3NSS_MASK                    equ 0003h
DAC3CON0_DAC3PSS_POSN                    equ 0002h
DAC3CON0_DAC3PSS_POSITION                equ 0002h
DAC3CON0_DAC3PSS_SIZE                    equ 0002h
DAC3CON0_DAC3PSS_LENGTH                  equ 0002h
DAC3CON0_DAC3PSS_MASK                    equ 000Ch
DAC3CON0_DAC3OE2_POSN                    equ 0004h
DAC3CON0_DAC3OE2_POSITION                equ 0004h
DAC3CON0_DAC3OE2_SIZE                    equ 0001h
DAC3CON0_DAC3OE2_LENGTH                  equ 0001h
DAC3CON0_DAC3OE2_MASK                    equ 0010h
DAC3CON0_DAC3OE1_POSN                    equ 0005h
DAC3CON0_DAC3OE1_POSITION                equ 0005h
DAC3CON0_DAC3OE1_SIZE                    equ 0001h
DAC3CON0_DAC3OE1_LENGTH                  equ 0001h
DAC3CON0_DAC3OE1_MASK                    equ 0020h
DAC3CON0_DAC3EN_POSN                     equ 0007h
DAC3CON0_DAC3EN_POSITION                 equ 0007h
DAC3CON0_DAC3EN_SIZE                     equ 0001h
DAC3CON0_DAC3EN_LENGTH                   equ 0001h
DAC3CON0_DAC3EN_MASK                     equ 0080h
DAC3CON0_DAC3NSS0_POSN                   equ 0000h
DAC3CON0_DAC3NSS0_POSITION               equ 0000h
DAC3CON0_DAC3NSS0_SIZE                   equ 0001h
DAC3CON0_DAC3NSS0_LENGTH                 equ 0001h
DAC3CON0_DAC3NSS0_MASK                   equ 0001h
DAC3CON0_DAC3NSS1_POSN                   equ 0001h
DAC3CON0_DAC3NSS1_POSITION               equ 0001h
DAC3CON0_DAC3NSS1_SIZE                   equ 0001h
DAC3CON0_DAC3NSS1_LENGTH                 equ 0001h
DAC3CON0_DAC3NSS1_MASK                   equ 0002h
DAC3CON0_DAC3PSS0_POSN                   equ 0002h
DAC3CON0_DAC3PSS0_POSITION               equ 0002h
DAC3CON0_DAC3PSS0_SIZE                   equ 0001h
DAC3CON0_DAC3PSS0_LENGTH                 equ 0001h
DAC3CON0_DAC3PSS0_MASK                   equ 0004h
DAC3CON0_DAC3PSS1_POSN                   equ 0003h
DAC3CON0_DAC3PSS1_POSITION               equ 0003h
DAC3CON0_DAC3PSS1_SIZE                   equ 0001h
DAC3CON0_DAC3PSS1_LENGTH                 equ 0001h
DAC3CON0_DAC3PSS1_MASK                   equ 0008h

